In [1]:
import pandas as pd

In [2]:
s= pd.Series([1,2,3,4])
type(s)
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s1=pd.Series([1,2,3,4],index=['A','B','C','D'])
s1

A    1
B    2
C    3
D    4
dtype: int64

In [6]:
data=[[1,444,'abc'],
      [2,555,'def'],
      [3,666,'ghi'],
      [4,777,'xyz']]
df= pd.DataFrame(data,columns=['ID','std_id','Dept'])
df

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     777  xyz

In [18]:
data_2={ 'ID':[1,2,3,4],
        'std_id':[444,555,666,777],
        'Dept':['abc','def','ghi','xyz']

}
df=pd.DataFrame(data_2)
df

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     777  xyz

 dataframe can read from all of all exel file, datafram

In [13]:
df=pd.DataFrame(data_2)
display(df)

   ID std_id Dept
0   1    444  abc
1   2    555  def
2   3    666  ghi
3   4    777  xyz

In [14]:
df.columns

Index(['ID', 'std_id', 'Dept'], dtype='object')

In [57]:
index =['row1','row2','row3','row4']
df.index =index
display(df)

      ID  std_id  Dept
row1   1     444   NaN
row2   2     555   NaN
row3   3     666   NaN
row4   4     777   NaN

poriroty of them

 object,string,float,integer,boolen
 if you see one of them it dominate of all the whole

In [ ]:
class student:
    def __init__(self,)

In [ ]:
p1=
p1.getinfo

In [19]:
df.dtypes

ID         int64
std_id     int64
Dept      object
dtype: object

In [20]:
df['Dept'].dtype

dtype('O')

In [21]:
df['Dept']=df['Dept'].astype('category')

In [25]:
df.dtypes

ID           int64
std_id       int64
Dept      category
dtype: object

In [ ]:
df.head()
#first 5 elements

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     777  xyz

In [28]:
df.tail()
#last 5 elements

   ID  std_id Dept
0   1     444  abc
1   2     555  def
2   3     666  ghi
3   4     777  xyz

In [29]:
df.tail(2)
#last 2 elements

   ID  std_id Dept
2   3     666  ghi
3   4     777  xyz

In [30]:
df.describe()

             ID      std_id
count  4.000000    4.000000
mean   2.500000  610.500000
std    1.290994  143.300384
min    1.000000  444.000000
25%    1.750000  527.250000
50%    2.500000  610.500000
75%    3.250000  693.750000
max    4.000000  777.000000

In [31]:
df.describe(include='category')

       Dept
count     4
unique    4
top     abc
freq      1

In [32]:
df.columns

Index(['ID', 'std_id', 'Dept'], dtype='object')

In [33]:
df['std_id'].unique().sum()

np.int64(2442)

In [34]:
df['std_id'].max()

np.int64(777)

In [72]:
df['std_id'].min()

np.int64(444)

In [71]:
df.Dept.idxmin()

C:\Users\zbook g6\AppData\Local\Temp\ipykernel_19624\3328458318.py:1: FutureWarning: The behavior of Series.idxmin with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.Dept.idxmin()

nan

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       4 non-null      int64
 1   std_id   4 non-null      int64
 2   Dept     0 non-null      float64
 3   new_col  4 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 332.0+ bytes

In [90]:
df['Dept'].value_counts()

Series([], Name: count, dtype: int64)

In [66]:
df['ID'].sum()

np.int64(10)

In [65]:
def duplicate(x):
    return x*2


df['std_id'].apply(duplicate)

row1     888
row2    1110
row3    1332
row4    1554
Name: std_id, dtype: int64

In [64]:
df['std_id'].apply(lambda x: x*2)

row1     888
row2    1110
row3    1332
row4    1554
Name: std_id, dtype: int64

In [62]:
df['ID'].iloc[2]

np.int64(3)

In [63]:
df.iloc[2,1]

np.int64(666)

In [88]:
df.Dept.iloc[0:3]

row1   NaN
row2   NaN
row3   NaN
Name: Dept, dtype: float64

In [89]:
df.Dept.iloc[:]

row1   NaN
row2   NaN
row3   NaN
row4   NaN
Name: Dept, dtype: float64

In [59]:
num_col=df.iloc[:,0:2]
cat_col=df.iloc[:,2:3]
print(num_col)
print(cat_col)

      ID  std_id
row1   1     444
row2   2     555
row3   3     666
row4   4     777
      Dept
row1   NaN
row2   NaN
row3   NaN
row4   NaN

In [58]:
num_col=df.iloc[:,:-1]
target_y=df.iloc[:,-1:]
num_col

      ID  std_id
row1   1     444
row2   2     555
row3   3     666
row4   4     777

In [73]:
new_col=df['std_id'] + df.ID
new_col

row1    445
row2    557
row3    669
row4    781
dtype: int64

In [75]:
df['new_col']=df['std_id']+ df.ID
df

      ID  std_id  Dept  new_col
row1   1     444   NaN      445
row2   2     555   NaN      557
row3   3     666   NaN      669
row4   4     777   NaN      781

In [79]:
df.drop('new_col',axis=1)

#colooooomn

      ID  std_id  Dept
row1   1     444   NaN
row2   2     555   NaN
row3   3     666   NaN
row4   4     777   NaN

In [80]:
df.drop('row2',axis=0)

#roooooooooooooooooooooooooow

      ID  std_id  Dept  new_col
row1   1     444   NaN      445
row3   3     666   NaN      669
row4   4     777   NaN      781

In [82]:
null =df.isnull
null

<bound method DataFrame.isnull of       ID  std_id  Dept  new_col
row1   1     444   NaN      445
row2   2     555   NaN      557
row3   3     666   NaN      669
row4   4     777   NaN      781>

In [86]:
df.isnull().sum()

ID         0
std_id     0
Dept       4
new_col    0
dtype: int64

In [94]:
null=df.isnull().sum()
pd.DataFrame(null)

         0
ID       0
std_id   0
Dept     4
new_col  0

In [97]:
def isNull(df):
    null=df.isnull().sum()
    return (pd.DataFrame(null))

isNull(df)

         0
ID       0
std_id   0
Dept     4
new_col  0

In [98]:
from isnullval import isNull
isNull(df)

ModuleNotFoundError: No module named 'isnullval'